source/blog/paradox.org
#+TITLE: Парадоксы это очень просто

Дзен-буддизм доносит свои идеи через коаны — загадки, у которых нет ответа, и в процессе их решения твой мозг коротит, и ты понимаешь что-то новое. Если с этим перестараться, ты станешь просветленным мудрецом, который считает, что знает всю истину.

Дискордианизм доносит свои идеи через иронию, и в попытках в ней разобраться, твой мозг коротит, и ты перестаешь понимать что-то, что понимал ранее. Если с этим перестараться, ты станешь лолрандомным эджлордом, у которого ничто не истинно, все дозволено.

Но найдя баланс, первым можно добавлять истинные убеждения, а вторым убирать ложные, что и составляет основу моей эпистемологии. Понятие, которое объединяет обе парадигмы — “парадокс”. И по сравнению с глубинами рекурсивного безумия, в которые придется погрузиться любому телепату, который рискнет прочитать мои мысли, существующие в нынешнем культурном пространстве парадоксы все очень примитивные, и их решение для меня лежит на поверхности. Позвольте мне продемонстрировать.

-----------

*** Парадокс неожиданной казни


*Суть*. Вас обещают казнить на этой неделе так, что для вас это будет сюрприз. Вас не могут казнить в последний возможный момент, потому что тогда вы перед ним будете знать, что вас казнят в него. Но если вы знаете, что не могут в последний, то по той же логике не могут и в предпоследний. По индукции, вы не можете быть казнены вообще. Поэтому когда вас вешают, для вас это неожиданно.


*Решение нормального человека*. Посреди сценария происходит подмена понятий, что считается “неожиданным”, парадокс возникает из-за этого.


*Решение Сопки-слоупока*. Меня казнят сразу после того, как сформулируют условие, до того, как я успею провести вот всю эту логическую цепочку и вообще осознать ситуацию, что для меня действительно будет очень неожиданно.


*** Парадокс неостановимой силы


*Суть*. Если неостановимое ядро влетит в неразрушаемую стену, что произойдет?


*Решение нормального человека*. Неостановимое ядро и неразрушаемая стена не могут существовать одновременно, парадокс возникает из-за противоречия в условиях задачи.


*Решение Сопки-душнилы*. Технически, если ядро клипнется сквозь стену, не разрушив ее, то и ядро не остановится, и стена не разрушится, противоречия нет, если у тебя достаточно странная физика.


*** Парадокс Банаха-Тарски


*Суть*. Можно разрезать сферу на конечное количество частей и собрать из них две такие же сферы.


*Решение нормального человека*. Математические множества работают немного не так, как физические объекты, этот случай просто демонстрирует.


*Решение ненормального человека*: Аксиома выбора ересь.


*Решение Сопки-татарки*. Это не парадокс, это физически реально, моя бабушка в голодные годы так картошку готовила.


*** Уловка-22


*Суть*. Если ты психически больной, то тебя освободят от службы. Но для этого тебе надо самому вызваться на психическое освидетельствование. А если ты это сделал, то ты мыслишь достаточно рационально, а значит не больной.


*Решение нормального человека*. Парадокс объясняется тем, что армия.


*Решение Сопки-неадеквата*. По мне и так будет понятно, что я психически больная, и мой начальник очень быстро пересмотрит установку, что нельзя лечить недобровольно.


*** Парадокс рога Габриэля


*Суть*. Можно построить геометрическую фигуру типа горна, у которой конечный объем, но бесконечная площадь поверхности.


*Решение нормального человека*. Бесконечность просто так работает, ее не всегда можно отобразить на нормальный физический объект.


*Решение Сопки-билингва*. А еще есть вувузела Габриэля, у которой конечная площадь поверхности, но бесконечный... volume... блин, на русском шутка не работает.


*** Парадокс парикмахера


*Суть*. Некий парикмахер бреет всех, кто не бреет себя. Бреет ли он себя?


*Решение нормального человека*. Это просто переусложненный парадокс лжеца, уже много копий сломано.


*Решение Сопки-трапа*. Я бы на его месте сделала лазерное удаление бороды, что можно изящно считать и брением себя, и не брением себя, в зависимости от того, в каком месте предложения ты находишься, увернувшись от парадокса демагогическим пируэтом.


*** Парадокс интересных чисел


*Суть*. Предположим, что существуют неинтересные натуральные числа. Тогда среди них есть самое маленькое неинтересное число. Но быть самым маленьким неинтересным числом само по себе интересное свойство! Противоречие, значит, все натуральные числа интересные.


*Решение нормального человека*. Понятие “интересные числа” не определено достаточно формально, так что парадокс возникает из неоднозначности.


*Решение Сопки-пессимиста*. Все числа скучные, жизнь вообще скучная, и то, что среди них есть наименьшее, интереснее ничего не делает. Множество интересных чисел пусто.


*** Парадокс пьяницы


*Суть*. В каждом баре есть человек, который, если пьет он, то пьют все, потому что вот так получится если ты посчитаешь логику.


*Решение нормального человека*. Человеческий язык не всегда следует формальной логике, и “если-то” среди мясных мешков может означать не только логическую импликацию, но и причинно-следственную связь. Парадокс возникает из-за этой путаницы понятий.


*Решение Сопки-fun-at-parties*. Этот человек — я, потому что после общения со мной любой забухает.


*** Парадокс корабля Тесея


*Суть*. Если я постепенно заменю все доски, из которых сделан корабль, на каком моменте он перестанет быть тем же кораблем?


*Решение нормального человека*. Понятие, что чем считается в смысле идентичности, определено неформально. Парадокс возникает из неоднозначности понятия.


*Решение Сопки-питониста*. Ты можешь выкинуть все доски и заменить корабль на бутерброд с колбасой, и это будет тот же корабль, потому что все типы ссылочные.


*** Парадокс кучи


*Суть*. Если я буду убирать из кучи зерен зерна по одному, на каком моменте это перестанет быть кучей?


*Решение нормального человека*. Понятие “кучи” само по себе неоднозначное, его можно определить как угодно.


*Решение Сопки-алгоритмиста*. Если убрать последнее зерно, останется куча размером в ноль зерен.


*** Парадокс нетранзитивных костей


*Суть*. Можно подобрать такой набор игральных костей, что в соревновании, на какой выпадет больше, любая из трех побеждает любую другую из трех.


*Решение нормального человека*. Здесь нет парадокса, просто люди путают немного ожидаемое значение и общее распределение вероятностей.


*Решение Сопки-игрока*. Здесь нет парадокса, просто теория вероятностей на дайсы не работает.


*** Парадокс дружбы


*Суть*. Почему эмпирически всегда так получается, что у твоих друзей больше друзей, чем у тебя?


*Решение нормального человека*. Если у человека больше друзей, то больше шанс, что ты будешь его другом, все логично, парадокса нет, это просто неинтуитивно.


*Решение Сопки-лонера*. Потому что я настолько плоха в построении отношений, что парадоксом не будет даже отрицательное число друзей.


*** Парадокс береговой линии


*Суть*. В зависимости от того, насколько точно ты измеряешь, длина берега Великобритании может быть и бесконечной.


*Решение нормального человека*. Фракталы просто так работают, что поделать.


*Решение Сопки-империалиста*. Великобритании принадлежит вся вселенная, а вселенная бесконечна, и берегов в ней тоже бесконечное количество. Чтобы длина берегов Великобритании была бесконечной, тут и фракталы подключать не надо.


*** Парадокс Монти Холла


*Суть*. В игре Монти Холла, поменять свой выбор всегда увеличивает шанс получить награду вместо козы.


*Решение нормального человека*. Да, из правил игры это просто следует, здесь нет парадокса, просто неинтуитивно.


*Решение Сопки-брони*. Всегда нравились копытные, я просто возьму козу.


*** Парадокс токсина Кавки


*Суть*. Богач предлагает тебя вознаградить, если в полночь ты будешь иметь намерение выпить не смертельный, но болезненный яд завтра. Он перечислит деньги еще до того, как выпьешь, так что пить технически необязательно, достаточно иметь намерение. Но это не может быть твоим планом, ведь если так, то намерения у тебя нет.


*Решение нормального человека*. Намерения людей всегда работают нелогично, ибо люди тупые, тут даже объяснять ничего не надо.


*Решение Сопки-прокрастинатора*. Если я приняла решение что-то сделать, то я как раз этого не сделаю. Обычно это плохо, но тут позволяет получить лучший из возможных миров!


*** Проблема зла


*Суть*. Если существует всесильный, всезнающий и всеблагой Бог, почему в мире есть зло?


*Решение нормального человека*. Парадокс возникает от того, что ты задаешь такие вопросы, хотя являешься воспламеняемым.


*Решение Сопки-мастера*. Я сделала поистине чудесный модуль, который дает ответ на этот вопрос, но поля сайта слишком узки для него.
