rss/data/paradox.html
<!DOCTYPE html>
<html lang="ru">
<head>
<!-- 2025-12-23 Tue 20:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Парадоксы это очень просто</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<p>
Дзен-буддизм доносит свои идеи через коаны — загадки, у которых нет ответа, и в процессе их решения твой мозг коротит, и ты понимаешь что-то новое. Если с этим перестараться, ты станешь просветленным мудрецом, который считает, что знает всю истину.<br>
</p>

<p>
Дискордианизм доносит свои идеи через иронию, и в попытках в ней разобраться, твой мозг коротит, и ты перестаешь понимать что-то, что понимал ранее. Если с этим перестараться, ты станешь лолрандомным эджлордом, у которого ничто не истинно, все дозволено.<br>
</p>

<p>
Но найдя баланс, первым можно добавлять истинные убеждения, а вторым убирать ложные, что и составляет основу моей эпистемологии. Понятие, которое объединяет обе парадигмы — “парадокс”. И по сравнению с глубинами рекурсивного безумия, в которые придется погрузиться любому телепату, который рискнет прочитать мои мысли, существующие в нынешнем культурном пространстве парадоксы все очень примитивные, и их решение для меня лежит на поверхности. Позвольте мне продемонстрировать.<br>
</p>

<hr>
<div id="outline-container-orgbe30f14" class="outline-2">
<h2 id="orgbe30f14">Парадокс неожиданной казни</h2>
<div class="outline-text-2" id="text-orgbe30f14">
<p>
<b>Суть</b>. Вас обещают казнить на этой неделе так, что для вас это будет сюрприз. Вас не могут казнить в последний возможный момент, потому что тогда вы перед ним будете знать, что вас казнят в него. Но если вы знаете, что не могут в последний, то по той же логике не могут и в предпоследний. По индукции, вы не можете быть казнены вообще. Поэтому когда вас вешают, для вас это неожиданно.<br>
</p>


<p>
<b>Решение нормального человека</b>. Посреди сценария происходит подмена понятий, что считается “неожиданным”, парадокс возникает из-за этого.<br>
</p>


<p>
<b>Решение Сопки-слоупока</b>. Меня казнят сразу после того, как сформулируют условие, до того, как я успею провести вот всю эту логическую цепочку и вообще осознать ситуацию, что для меня действительно будет очень неожиданно.<br>
</p>
</div>
</div>
<div id="outline-container-orgaf7dd94" class="outline-2">
<h2 id="orgaf7dd94">Парадокс неостановимой силы</h2>
<div class="outline-text-2" id="text-orgaf7dd94">
<p>
<b>Суть</b>. Если неостановимое ядро влетит в неразрушаемую стену, что произойдет?<br>
</p>


<p>
<b>Решение нормального человека</b>. Неостановимое ядро и неразрушаемая стена не могут существовать одновременно, парадокс возникает из-за противоречия в условиях задачи.<br>
</p>


<p>
<b>Решение Сопки-душнилы</b>. Технически, если ядро клипнется сквозь стену, не разрушив ее, то и ядро не остановится, и стена не разрушится, противоречия нет, если у тебя достаточно странная физика.<br>
</p>
</div>
</div>
<div id="outline-container-org1ca7ca7" class="outline-2">
<h2 id="org1ca7ca7">Парадокс Банаха-Тарски</h2>
<div class="outline-text-2" id="text-org1ca7ca7">
<p>
<b>Суть</b>. Можно разрезать сферу на конечное количество частей и собрать из них две такие же сферы.<br>
</p>


<p>
<b>Решение нормального человека</b>. Математические множества работают немного не так, как физические объекты, этот случай просто демонстрирует.<br>
</p>


<p>
<b>Решение ненормального человека</b>: Аксиома выбора ересь.<br>
</p>


<p>
<b>Решение Сопки-татарки</b>. Это не парадокс, это физически реально, моя бабушка в голодные годы так картошку готовила.<br>
</p>
</div>
</div>
<div id="outline-container-org836ab24" class="outline-2">
<h2 id="org836ab24">Уловка-22</h2>
<div class="outline-text-2" id="text-org836ab24">
<p>
<b>Суть</b>. Если ты психически больной, то тебя освободят от службы. Но для этого тебе надо самому вызваться на психическое освидетельствование. А если ты это сделал, то ты мыслишь достаточно рационально, а значит не больной.<br>
</p>


<p>
<b>Решение нормального человека</b>. Парадокс объясняется тем, что армия.<br>
</p>


<p>
<b>Решение Сопки-неадеквата</b>. По мне и так будет понятно, что я психически больная, и мой начальник очень быстро пересмотрит установку, что нельзя лечить недобровольно.<br>
</p>
</div>
</div>
<div id="outline-container-orge0a4eca" class="outline-2">
<h2 id="orge0a4eca">Парадокс рога Габриэля</h2>
<div class="outline-text-2" id="text-orge0a4eca">
<p>
<b>Суть</b>. Можно построить геометрическую фигуру типа горна, у которой конечный объем, но бесконечная площадь поверхности.<br>
</p>


<p>
<b>Решение нормального человека</b>. Бесконечность просто так работает, ее не всегда можно отобразить на нормальный физический объект.<br>
</p>


<p>
<b>Решение Сопки-билингва</b>. А еще есть вувузела Габриэля, у которой конечная площадь поверхности, но бесконечный&#x2026; volume&#x2026; блин, на русском шутка не работает.<br>
</p>
</div>
</div>
<div id="outline-container-org6810a86" class="outline-2">
<h2 id="org6810a86">Парадокс парикмахера</h2>
<div class="outline-text-2" id="text-org6810a86">
<p>
<b>Суть</b>. Некий парикмахер бреет всех, кто не бреет себя. Бреет ли он себя?<br>
</p>


<p>
<b>Решение нормального человека</b>. Это просто переусложненный парадокс лжеца, уже много копий сломано.<br>
</p>


<p>
<b>Решение Сопки-трапа</b>. Я бы на его месте сделала лазерное удаление бороды, что можно изящно считать и брением себя, и не брением себя, в зависимости от того, в каком месте предложения ты находишься, увернувшись от парадокса демагогическим пируэтом.<br>
</p>
</div>
</div>
<div id="outline-container-orgae85e93" class="outline-2">
<h2 id="orgae85e93">Парадокс интересных чисел</h2>
<div class="outline-text-2" id="text-orgae85e93">
<p>
<b>Суть</b>. Предположим, что существуют неинтересные натуральные числа. Тогда среди них есть самое маленькое неинтересное число. Но быть самым маленьким неинтересным числом само по себе интересное свойство! Противоречие, значит, все натуральные числа интересные.<br>
</p>


<p>
<b>Решение нормального человека</b>. Понятие “интересные числа” не определено достаточно формально, так что парадокс возникает из неоднозначности.<br>
</p>


<p>
<b>Решение Сопки-пессимиста</b>. Все числа скучные, жизнь вообще скучная, и то, что среди них есть наименьшее, интереснее ничего не делает. Множество интересных чисел пусто.<br>
</p>
</div>
</div>
<div id="outline-container-orgabf2354" class="outline-2">
<h2 id="orgabf2354">Парадокс пьяницы</h2>
<div class="outline-text-2" id="text-orgabf2354">
<p>
<b>Суть</b>. В каждом баре есть человек, который, если пьет он, то пьют все, потому что вот так получится если ты посчитаешь логику.<br>
</p>


<p>
<b>Решение нормального человека</b>. Человеческий язык не всегда следует формальной логике, и “если-то” среди мясных мешков может означать не только логическую импликацию, но и причинно-следственную связь. Парадокс возникает из-за этой путаницы понятий.<br>
</p>


<p>
<b>Решение Сопки-fun-at-parties</b>. Этот человек — я, потому что после общения со мной любой забухает.<br>
</p>
</div>
</div>
<div id="outline-container-org97c00f8" class="outline-2">
<h2 id="org97c00f8">Парадокс корабля Тесея</h2>
<div class="outline-text-2" id="text-org97c00f8">
<p>
<b>Суть</b>. Если я постепенно заменю все доски, из которых сделан корабль, на каком моменте он перестанет быть тем же кораблем?<br>
</p>


<p>
<b>Решение нормального человека</b>. Понятие, что чем считается в смысле идентичности, определено неформально. Парадокс возникает из неоднозначности понятия.<br>
</p>


<p>
<b>Решение Сопки-питониста</b>. Ты можешь выкинуть все доски и заменить корабль на бутерброд с колбасой, и это будет тот же корабль, потому что все типы ссылочные.<br>
</p>
</div>
</div>
<div id="outline-container-org3a4bcf5" class="outline-2">
<h2 id="org3a4bcf5">Парадокс кучи</h2>
<div class="outline-text-2" id="text-org3a4bcf5">
<p>
<b>Суть</b>. Если я буду убирать из кучи зерен зерна по одному, на каком моменте это перестанет быть кучей?<br>
</p>


<p>
<b>Решение нормального человека</b>. Понятие “кучи” само по себе неоднозначное, его можно определить как угодно.<br>
</p>


<p>
<b>Решение Сопки-алгоритмиста</b>. Если убрать последнее зерно, останется куча размером в ноль зерен.<br>
</p>
</div>
</div>
<div id="outline-container-org80458d6" class="outline-2">
<h2 id="org80458d6">Парадокс нетранзитивных костей</h2>
<div class="outline-text-2" id="text-org80458d6">
<p>
<b>Суть</b>. Можно подобрать такой набор игральных костей, что в соревновании, на какой выпадет больше, любая из трех побеждает любую другую из трех.<br>
</p>


<p>
<b>Решение нормального человека</b>. Здесь нет парадокса, просто люди путают немного ожидаемое значение и общее распределение вероятностей.<br>
</p>


<p>
<b>Решение Сопки-игрока</b>. Здесь нет парадокса, просто теория вероятностей на дайсы не работает.<br>
</p>
</div>
</div>
<div id="outline-container-orgcdd5f5b" class="outline-2">
<h2 id="orgcdd5f5b">Парадокс дружбы</h2>
<div class="outline-text-2" id="text-orgcdd5f5b">
<p>
<b>Суть</b>. Почему эмпирически всегда так получается, что у твоих друзей больше друзей, чем у тебя?<br>
</p>


<p>
<b>Решение нормального человека</b>. Если у человека больше друзей, то больше шанс, что ты будешь его другом, все логично, парадокса нет, это просто неинтуитивно.<br>
</p>


<p>
<b>Решение Сопки-лонера</b>. Потому что я настолько плоха в построении отношений, что парадоксом не будет даже отрицательное число друзей.<br>
</p>
</div>
</div>
<div id="outline-container-orgf245728" class="outline-2">
<h2 id="orgf245728">Парадокс береговой линии</h2>
<div class="outline-text-2" id="text-orgf245728">
<p>
<b>Суть</b>. В зависимости от того, насколько точно ты измеряешь, длина берега Великобритании может быть и бесконечной.<br>
</p>


<p>
<b>Решение нормального человека</b>. Фракталы просто так работают, что поделать.<br>
</p>


<p>
<b>Решение Сопки-империалиста</b>. Великобритании принадлежит вся вселенная, а вселенная бесконечна, и берегов в ней тоже бесконечное количество. Чтобы длина берегов Великобритании была бесконечной, тут и фракталы подключать не надо.<br>
</p>
</div>
</div>
<div id="outline-container-org350a340" class="outline-2">
<h2 id="org350a340">Парадокс Монти Холла</h2>
<div class="outline-text-2" id="text-org350a340">
<p>
<b>Суть</b>. В игре Монти Холла, поменять свой выбор всегда увеличивает шанс получить награду вместо козы.<br>
</p>


<p>
<b>Решение нормального человека</b>. Да, из правил игры это просто следует, здесь нет парадокса, просто неинтуитивно.<br>
</p>


<p>
<b>Решение Сопки-брони</b>. Всегда нравились копытные, я просто возьму козу.<br>
</p>
</div>
</div>
<div id="outline-container-orgd1ace61" class="outline-2">
<h2 id="orgd1ace61">Парадокс токсина Кавки</h2>
<div class="outline-text-2" id="text-orgd1ace61">
<p>
<b>Суть</b>. Богач предлагает тебя вознаградить, если в полночь ты будешь иметь намерение выпить не смертельный, но болезненный яд завтра. Он перечислит деньги еще до того, как выпьешь, так что пить технически необязательно, достаточно иметь намерение. Но это не может быть твоим планом, ведь если так, то намерения у тебя нет.<br>
</p>


<p>
<b>Решение нормального человека</b>. Намерения людей всегда работают нелогично, ибо люди тупые, тут даже объяснять ничего не надо.<br>
</p>


<p>
<b>Решение Сопки-прокрастинатора</b>. Если я приняла решение что-то сделать, то я как раз этого не сделаю. Обычно это плохо, но тут позволяет получить лучший из возможных миров!<br>
</p>
</div>
</div>
<div id="outline-container-org5d5375b" class="outline-2">
<h2 id="org5d5375b">Проблема зла</h2>
<div class="outline-text-2" id="text-org5d5375b">
<p>
<b>Суть</b>. Если существует всесильный, всезнающий и всеблагой Бог, почему в мире есть зло?<br>
</p>


<p>
<b>Решение нормального человека</b>. Парадокс возникает от того, что ты задаешь такие вопросы, хотя являешься воспламеняемым.<br>
</p>


<p>
<b>Решение Сопки-мастера</b>. Я сделала поистине чудесный модуль, который дает ответ на этот вопрос, но поля сайта слишком узки для него.<br>
</p>
</div>
</div>
</div>
</body>
</html>
